ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263P/SDFM_SDFM_50268000h.xml
		<bitfield id="SDDATASYNC" width="1" begin="6" end="6" resetval="0x0" description="0: SD Data is not passed through a synchronizer. 1:SD Data is passed through a synchronizer." range="6" rwaccess="R/W"/>
	<bitfield id="SDCLKSYNC" width="1" begin="4" end="4" resetval="0x0" description="0: SD Clock is not passed through a synchronizer. 1:SD Clock is passed through a synchronizer." range="4" rwaccess="R/W"/>
	<bitfield id="SDCLKSEL" width="1" begin="3" end="3" resetval="0x0" description="SD4 Clock source select. 0:Clock source to SDFM filter is its channel clock. 1:Clock source to SDFM filter is SD1 filter clock." range="3" rwaccess="R/W"/>
	<bitfield id="MOD" width="2" begin="1" end="0" resetval="0x0" description="Modulator clock modes  0:Mode0:Modulator clock running at 1x data rate 1:Reserved 2:Reserved 3:Reserved" range="1:0" rwaccess="R/W"/>
	</register><register id="SDFM_SDDFPARM4" acronym="SDFM_SDDFPARM4" offset="130" width="16" description="Data Filter Parameter Register for Ch4.">
		<bitfield id="SDSYNCEN" width="1" begin="12" end="12" resetval="0x0" description="PWM synchronization [SDSYNC] of data filter  0:PWM synchronization  of data filter is disabled  1:PWM synchronization of data filter is enabled  Note: SDSYNCx.SYNCSEL bits define which PWM signal is used to              synchronize PWMs" range="12" rwaccess="R/W"/>
	<bitfield id="SST" width="2" begin="11" end="10" resetval="0x0" description="Data filter structure  00:Data filter runs with a Sincfast structure 01:Data filter runs with a Sinc1 structure 10:Data filter runs with a Sinc2 structure 11:Data filter runs with a Sinc3 structure" range="11:10" rwaccess="R/W"/>
	<bitfield id="AE" width="1" begin="9" end="9" resetval="0x0" description="Data filter Acknowledge Enable  0:Acknowledge flag is disabled for the particular filter  1:Acknowledge flag is enabled for the particular filter" range="9" rwaccess="R/W"/>
	<bitfield id="FEN" width="1" begin="8" end="8" resetval="0x0" description="Filter Enable  0: The data filter is disabled and no data is produced  1: The data filter is enabled and data are produced in the data filter  Note: When filter is disabled, DOSR counter held in reset, filter data          erased. Also resets FIFO pointers and clears the FIFO" range="8" rwaccess="R/W"/>
	<bitfield id="DOSR" width="8" begin="7" end="0" resetval="0x0" description="Data filter Oversampling ratio  The actual oversampling ratio of data filter is DOSR + 1  These bits set the oversampling ratio of the data filter. 0x0FF represents an oversampling ratio of 256." range="7:0" rwaccess="R/W"/>
	</register><register id="SDFM_SDDPARM4" acronym="SDFM_SDDPARM4" offset="132" width="16" description="Data Parameter Register for Ch4.">
		<bitfield id="SH" width="5" begin="15" end="11" resetval="0x0" description="Shift Control These bits indicate by how many bits the 16-bit window is shifted up when 16-bit data representation is chosen." range="15:11" rwaccess="R/W"/>
	<bitfield id="DR" width="1" begin="10" end="10" resetval="0x0" description="Data filter Data representation  0:Data stored in16b2's complement  1:Data stored in32b2's complement" range="10" rwaccess="R/W"/>
	</register><register id="SDFM_SDFLT4CMPH1" acronym="SDFM_SDFLT4CMPH1" offset="134" width="16" description="High-level Threshold Register for Ch4.">
		<bitfield id="HLT" width="15" begin="14" end="0" resetval="0x32767" description="Unsigned high-level threshold for the comparator filter output." range="14:0" rwaccess="R/W"/>
	</register><register id="SDFM_SDFLT4CMPL1" acronym="SDFM_SDFLT4CMPL1" offset="136" width="16" description="Low-level Threshold Register for Ch4.">
		<bitfield id="LLT" width="15" begin="14" end="0" resetval="0x0" description="Unsigned low-level threshold for the comparator filter output." range="14:0" rwaccess="R/W"/>
	</register><register id="SDFM_SDCPARM4" acronym="SDFM_SDCPARM4" offset="138" width="16" description="Comparator Filter Parameter Register for Ch4.">
		<bitfield id="CEVT2SEL" width="2" begin="15" end="14" resetval="0x0" description="Comparator Event2 Select 00: COMPL1 01:COMPL1 OR COMPH1 10:COMPL2 11:COMPL2 OR COMPH2" range="15:14" rwaccess="R/W"/>
	<bitfield id="CEN" width="1" begin="13" end="13" resetval="0x0" description="Comparator Filter enable  0:Disable comparator filter  1:Enable comparator filter" range="13" rwaccess="R/W"/>
	<bitfield id="CEVT1SEL" width="2" begin="12" end="11" resetval="0x0" description="Comparator Event1 Select 00: COMPH1 01:COMPL1 OR COMPH1 10:COMPH2 11:COMPL2 OR COMPH2" range="12:11" rwaccess="R/W"/>
	<bitfield id="HZEN" width="1" begin="10" end="10" resetval="0x0" description="High level [Z] Threshold crossing output enable  0:Disable Higher level Threshold [Z] crossing  1:Enable Higher level Threhold [Z] crossing " range="10" rwaccess="R/W"/>
	<bitfield id="MFIE" width="1" begin="9" end="9" resetval="0x0" description="Modulator Failure Interrupt Enable  0:Disable modulator failure interrupt and its flag  1:Enable modulator failure interrupt and its flag" range="9" rwaccess="R/W"/>
	<bitfield id="CS1_CS0" width="2" begin="8" end="7" resetval="0x0" description="Comparator filter structure  00:Comparator filter runs with a sincfast structure 01:Comparator filter runs with a Sinc1 structure 10:Comparator filter runs with a Sinc2 structure 11:Comparator filter runs with a Sinc3 structure" range="8:7" rwaccess="R/W"/>
	<bitfield id="EN_CEVT2" width="1" begin="6" end="6" resetval="0x0" description="CEVT2 interrupt enable  0:Disable CEVT2 interrupt  1:Enable CEVT2 interrupt" range="6" rwaccess="R/W"/>
	<bitfield id="EN_CEVT1" width="1" begin="5" end="5" resetval="0x0" description="CEVT1 interrupt enable  0:Disable CEVT1 interrupt  1:Enable CEVT1 interrupt" range="5" rwaccess="R/W"/>
	<bitfield id="COSR" width="5" begin="4" end="0" resetval="0x0" description="Comparator Oversampling ratio.   The actual rate is COSR + 1. These bits set the oversampling ratio of the filter. 0x1F represents an oversampling ratio of 32" range="4:0" rwaccess="R/W"/>
	</register><register id="SDFM_SDDATA4" acronym="SDFM_SDDATA4" offset="140" width="32" description="Data Filter Data Register (16 or 32bit) for Ch4.">
		<bitfield id="DATA32HI" width="16" begin="31" end="16" resetval="0x0" description="Hi-order16bin32bmode, 16-bit Data in16bmode" range="31:16" rwaccess="R"/>
	<bitfield id="DATA16" width="16" begin="15" end="0" resetval="0x0" description="Lo-order16bin32bmode" range="15:0" rwaccess="R"/>
	</register><register id="SDFM_SDDATFIFO4" acronym="SDFM_SDDATFIFO4" offset="144" width="32" description="Filter Data FIFO Output(32b) for Ch4.">
		<bitfield id="DATA32HI" width="16" begin="31" end="16" resetval="0x0" description="Hi-order16bin32bmode, 16-bit Data in16bmode" range="31:16" rwaccess="R"/>
	<bitfield id="DATA16" width="16" begin="15" end="0" resetval="0x0" description="Lo-order16bin32bmode" range="15:0" rwaccess="R"/>
	</register><register id="SDFM_SDCDATA4" acronym="SDFM_SDCDATA4" offset="148" width="16" description="Comparator Filter Data Register (16b) for Ch4.">
		<bitfield id="DATA16" width="16" begin="15" end="0" resetval="0x0" description="Comparator Data output -16bonly" range="15:0" rwaccess="R"/>
	</register><register id="SDFM_SDFLT4CMPH2" acronym="SDFM_SDFLT4CMPH2" offset="150" width="16" description="Second high level threhold  for CH4.">
		<bitfield id="HLT2" width="15" begin="14" end="0" resetval="0x32767" description="Second Unsigned high-level threshold for the comparator filter output." range="14:0" rwaccess="R/W"/>
	</register><register id="SDFM_SDFLT4CMPHZ" acronym="SDFM_SDFLT4CMPHZ" offset="152" width="16" description="High-level (Z) Threshold Register for Ch4.">
		<bitfield id="HLTZ" width="15" begin="14" end="0" resetval="0x0" description="Unsigned High-level threshold [Z] for the comparator filter output  Primarily intended for detecting 'zero'-crossing events. Unlike the primary comparator SDCMPHx, it does not have the ability to generate an interrupt." range="14:0" rwaccess="R/W"/>
	</register><register id="SDFM_SDFIFOCTL4" acronym="SDFM_SDFIFOCTL4" offset="154" width="16" description="FIFO Control Register for Ch4.">
		<bitfield id="OVFIEN" width="1" begin="15" end="15" resetval="0x0" description="SDFIFO Overflow interrupt enable  0:SDFIFO Overflow condition will not generate an interrupt  1:SDFIFO overflow condition generates an interrupt on SDy_ERR" range="15" rwaccess="R/W"/>
	<bitfield id="DRINTSEL" width="1" begin="14" end="14" resetval="0x0" description="Data-Ready Interrupt [DRINT] source select  0 = AF1          [Select non-FIFO data-ready interrupt]  1 = SDFFINT1 [Select FIFO data-ready interrupt]" range="14" rwaccess="R/W"/>
	<bitfield id="FFEN" width="1" begin="13" end="13" resetval="0x0" description="SDFIFO Enable  0: Disable FIFO operation 1: Enable FIFO operation  Note: When FIFO is disabled, FIFO contents are cleared" range="13" rwaccess="R/W"/>
	<bitfield id="FFIEN" width="1" begin="12" end="12" resetval="0x0" description="SDFIFO data ready Interrupt Enable" range="12" rwaccess="R/W"/>
	<bitfield id="SDFFST" width="5" begin="10" end="6" resetval="0x0" description="SDFIFO Status  00000 FIFO empty 00001 FIFO has 1 word  . . . . 10000 FIFO has 16 words" range="10:6" rwaccess="R"/>
	<bitfield id="SDFFIL" width="5" begin="4" end="0" resetval="0x0" description="SDFIFO interrupt level bits   The FIFO will generate an interrupt when the FIFO status [SDFFST] '= FIFO level [SDFFIL ] " range="4:0" rwaccess="R/W"/>
	</register><register id="SDFM_SDSYNC4" acronym="SDFM_SDSYNC4" offset="156" width="16" description="SD Filter Sync control for Ch4.">
		<bitfield id="WTSCLREN" width="1" begin="10" end="10" resetval="0x1" description="WTSYNFLG Clear-on-FIFOINT Enable  0:WTSYNFLG can only be cleared manually [using WTSYNCLR bit]  1:WTSYNFLG is cleared automatically on SDFFINT" range="10" rwaccess="R/W"/>
	<bitfield id="FFSYNCCLREN" width="1" begin="9" end="9" resetval="0x0" description="FIFO Clear-on-SDSYNC Enable  0:SDFIFO is not automaticaly cleared upon receiving SDSYNC   1:SDFIFO is automaticaly cleared upon receiving SDSYNC" range="9" rwaccess="R/W"/>
	<bitfield id="WTSYNCLR" width="1" begin="8" end="8" resetval="0x0" description="Wait-for-Sync Flag Clear [always reads 0]  0:Write of 0 has no effect  1:Write of 1 clears WTSYNFLG" range="8" rwaccess="R/W"/>
	<bitfield id="WTSYNFLG" width="1" begin="7" end="7" resetval="0x0" description="Wait-for-Sync Flag  0:SDSYNC event has not occurred  1:SDSYNC event occurred.  " range="7" rwaccess="R"/>
	<bitfield id="WTSYNCEN" width="1" begin="6" end="6" resetval="0x0" description="Wait-for-Sync Enable  0:Incoming Data written to SDFIFO on every Data-Ready [DR] Event  1:Incoming Data written to SDFIFO on DR event only after SDSYNC event occurs" range="6" rwaccess="R/W"/>
	<bitfield id="SYNCSEL" width="6" begin="5" end="0" resetval="0x0" description="Defines source for the SDSYNC Input on this channel  Refer SDSYNCx.SYNCSEL table" range="5:0" rwaccess="R/W"/>
	</register><register id="SDFM_SDFLT4CMPL2" acronym="SDFM_SDFLT4CMPL2" offset="158" width="16" description="Second low level threhold  for CH4.">
		<bitfield id="LLT2" width="15" begin="14" end="0" resetval="0x0" description="Second Unsigned low-level threshold for the comparator filter output." range="14:0" rwaccess="R/W"/>
	</register><register id="SDFM_SDCOMP1CTL" acronym="SDFM_SDCOMP1CTL" offset="192" width="16" description="SD Comparator event filter1 Control Register.">
		<bitfield id="CEVT2DIGFILTSEL" width="2" begin="11" end="10" resetval="0x0" description="High comparator COMPH source select.    0  CEVT2 output drives COMPLOUT   1  Reserved   2  Output of digital filter drives COMPLOUT   3  Reserved" range="11:10" rwaccess="R/W"/>
	<bitfield id="CEVT1DIGFILTSEL" width="2" begin="3" end="2" resetval="0x0" description="High comparator COMPH source select.    0  CEVT1 output drives COMPHOUT   1  Reserved   2  Output of digital filter drives COMPHOUT   3  Reserved" range="3:2" rwaccess="R/W"/>
	</register><register id="SDFM_SDCOMP1EVT2FLTCTL" acronym="SDFM_SDCOMP1EVT2FLTCTL" offset="194" width="16" description="COMPL/CEVT2 Digital filter1 Control Register.">
		<bitfield id="FILINIT" width="1" begin="15" end="15" resetval="0x0" description="Low filter initialization.    0  No effect   1  Initialize all samples to the filter input value" range="15" rwaccess="R/W1TS"/>
	<bitfield id="THRESH" width="5" begin="13" end="9" resetval="0x0" description="Low filter majority voting threshold. At least THRESH samples of the opposite state must appear within the sample window in order for the output to change state." range="13:9" rwaccess="R/W"/>
	<bitfield id="SAMPWIN" width="5" begin="8" end="4" resetval="0x0" description="Low filter sample window size. Number of samples to monitor is SAMPWIN+1." range="8:4" rwaccess="R/W"/>
	</register><register id="SDFM_SDCOMP1EVT2FLTCLKCTL" acronym="SDFM_SDCOMP1EVT2FLTCLKCTL" offset="196" width="16" description="COMPL/CEVT2 Digital filter1 Clock Control Register.">
		<bitfield id="CLKPRESCALE" width="10" begin="9" end="0" resetval="0x0" description="Low filter sample clock prescale. Number of system clocks between samples." range="9:0" rwaccess="R/W"/>
	</register><register id="SDFM_SDCOMP1EVT1FLTCTL" acronym="SDFM_SDCOMP1EVT1FLTCTL" offset="198" width="16" description="COMPH/CEVT1 Digital filter1 Control Register.">
		<bitfield id="FILINIT" width="1" begin="15" end="15" resetval="0x0" description="High filter initialization.    0  No effect   1  Initialize all samples to the filter input value" range="15" rwaccess="R/W1TS"/>
	<bitfield id="THRESH" width="5" begin="13" end="9" resetval="0x0" description="High filter majority voting threshold. At least THRESH samples of the opposite state must appear within the sample window in order for the output to change state." range="13:9" rwaccess="R/W"/>
	<bitfield id="SAMPWIN" width="5" begin="8" end="4" resetval="0x0" description="High filter sample window size. Number of samples to monitor is SAMPWIN+1." range="8:4" rwaccess="R/W"/>
	</register><register id="SDFM_SDCOMP1EVT1FLTCLKCTL" acronym="SDFM_SDCOMP1EVT1FLTCLKCTL" offset="200" width="16" description="COMPH/CEVT1 Digital filter1 Clock Control Register.">
		<bitfield id="CLKPRESCALE" width="10" begin="9" end="0" resetval="0x0" description="High filter sample clock prescale. Number of system clocks between samples." range="9:0" rwaccess="R/W"/>
	</register><register id="SDFM_SDCOMP1LOCK" acronym="SDFM_SDCOMP1LOCK" offset="206" width="16" description="SD  compartor event filter1 Lock Register.">
		<bitfield id="COMP" width="1" begin="3" end="3" resetval="0x0" description="Lock write-access to the SDCOMP1EVT1/2FLTTCTL and COMP1FILCLKCTL registers.    0  SDCOMP1EVT1/2FLTCTL and SDCOMP1EVT1/2FLTCLKCTL registers are not locked. Write 0 to this bit has no effect.   1  SDCOMP1EVT1/2FLTCTL and SDCOMP1EVT1/2FLTCLKCTL registers are locked. Only a system reset can clear this bit." range="3" rwaccess="R/W1TS"/>
	<bitfield id="SDCOMP1CTL" width="1" begin="0" end="0" resetval="0x0" description="Lock write-access to the SDCOMP1CTL register.    0  SDCOMP1CTL register is not locked. Write 0 to this bit has no effect.   1  SDCOMP1CTL register is locked. Only a system reset can clear this bit." range="0" rwaccess="R/W1TS"/>
	</register><register id="SDFM_SDCOMP2CTL" acronym="SDFM_SDCOMP2CTL" offset="208" width="16" description="SD Comparator event filter2 Control Register.">
		<bitfield id="CEVT2DIGFILTSEL" width="2" begin="11" end="10" resetval="0x0" description="High comparator COMPH source select.    0  CEVT2 output drives COMPLOUT   1  Reserved   2  Output of digital filter drives COMPLOUT   3  Reserved" range="11:10" rwaccess="R/W"/>
	<bitfield id="CEVT1DIGFILTSEL" width="2" begin="3" end="2" resetval="0x0" description="High comparator COMPH source select.    0  CEVT1 output drives COMPHOUT   1  Reserved   2  Output of digital filter drives COMPHOUT   3  Reserved" range="3:2" rwaccess="R/W"/>
	</register><register id="SDFM_SDCOMP2EVT2FLTCTL" acronym="SDFM_SDCOMP2EVT2FLTCTL" offset="210" width="16" description="COMPL/CEVT2 Digital filter2 Control Register.">
		<bitfield id="FILINIT" width="1" begin="15" end="15" resetval="0x0" description="Low filter initialization.    0  No effect   1  Initialize all samples to the filter input value" range="15" rwaccess="R/W1TS"/>
	<bitfield id="THRESH" width="5" begin="13" end="9" resetval="0x0" description="Low filter majority voting threshold. At least THRESH samples of the opposite state must appear within the sample window in order for the output to change state." range="13:9" rwaccess="R/W"/>
	<bitfield id="SAMPWIN" width="5" begin="8" end="4" resetval="0x0" description="Low filter sample window size. Number of samples to monitor is SAMPWIN+1." range="8:4" rwaccess="R/W"/>
	</register><register id="SDFM_SDCOMP2EVT2FLTCLKCTL" acronym="SDFM_SDCOMP2EVT2FLTCLKCTL" offset="212" width="16" description="COMPL/CEVT2 Digital filter2 Clock Control Register.">
		<bitfield id="CLKPRESCALE" width="10" begin="9" end="0" resetval="0x0" description="Low filter sample clock prescale. Number of system clocks between samples." range="9:0" rwaccess="R/W"/>
	</register><register id="SDFM_SDCOMP2EVT1FLTCTL" acronym="SDFM_SDCOMP2EVT1FLTCTL" offset="214" width="16" description="COMPH/CEVT1 Digital filter2 Control Register.">
		<bitfield id="FILINIT" width="1" begin="15" end="15" resetval="0x0" description="High filter initialization.    0  No effect   1  Initialize all samples to the filter input value" range="15" rwaccess="R/W1TS"/>
	<bitfield id="THRESH" width="5" begin="13" end="9" resetval="0x0" description="High filter majority voting threshold. At least THRESH samples of the opposite state must appear within the sample window in order for the output to change state." range="13:9" rwaccess="R/W"/>
	<bitfield id="SAMPWIN" width="5" begin="8" end="4" resetval="0x0" description="High filter sample window size. Number of samples to monitor is SAMPWIN+1." range="8:4" rwaccess="R/W"/>
	</register><register id="SDFM_SDCOMP2EVT1FLTCLKCTL" acronym="SDFM_SDCOMP2EVT1FLTCLKCTL" offset="216" width="16" description="COMPH/CEVT1 Digital filter2 Clock Control Register.">
		<bitfield id="CLKPRESCALE" width="10" begin="9" end="0" resetval="0x0" description="High filter sample clock prescale. Number of system clocks between samples." range="9:0" rwaccess="R/W"/>
	</register><register id="SDFM_SDCOMP2LOCK" acronym="SDFM_SDCOMP2LOCK" offset="222" width="16" description="SD  compartor event filter2 Lock Register.">
		<bitfield id="COMP" width="1" begin="3" end="3" resetval="0x0" description="Lock write-access to the SDCOMP2EVT1/2FLTTCTL and COMP2FILCLKCTL registers.    0  SDCOMP2EVT1/2FLTCTL and SDCOMP2EVT1/2FLTCLKCTL registers are not locked. Write 0 to this bit has no effect.   1  SDCOMP2EVT1/2FLTCTL and SDCOMP2EVT1/2FLTCLKCTL registers are locked. Only a system reset can clear this bit." range="3" rwaccess="R/W1TS"/>
	<bitfield id="SDCOMP2CTL" width="1" begin="0" end="0" resetval="0x0" description="Lock write-access to the SDCOMP2CTL register.    0  SDCOMP2CTL register is not locked. Write 0 to this bit has no effect.   1  SDCOMP2CTL register is locked. Only a system reset can clear this bit." range="0" rwaccess="R/W1TS"/>
	</register><register id="SDFM_SDCOMP3CTL" acronym="SDFM_SDCOMP3CTL" offset="224" width="16" description="SD Comparator event filter3 Control Register.">
		<bitfield id="CEVT2DIGFILTSEL" width="2" begin="11" end="10" resetval="0x0" description="High comparator COMPH source select.    0  CEVT2 output drives COMPLOUT   1  Reserved   2  Output of digital filter drives COMPLOUT   3  Reserved" range="11:10" rwaccess="R/W"/>
	<bitfield id="CEVT1DIGFILTSEL" width="2" begin="3" end="2" resetval="0x0" description="High comparator COMPH source select.    0  CEVT1 output drives COMPHOUT   1  Reserved   2  Output of digital filter drives COMPHOUT   3  Reserved" range="3:2" rwaccess="R/W"/>
	</register><register id="SDFM_SDCOMP3EVT2FLTCTL" acronym="SDFM_SDCOMP3EVT2FLTCTL" offset="226" width="16" description="COMPL/CEVT2 Digital filter3 Control Register.">
		<bitfield id="FILINIT" width="1" begin="15" end="15" resetval="0x0" description="Low filter initialization.    0  No effect   1  Initialize all samples to the filter input value" range="15" rwaccess="R/W1TS"/>
	<bitfield id="THRESH" width="5" begin="13" end="9" resetval="0x0" description="Low filter majority voting threshold. At least THRESH samples of the opposite state must appear within the sample window in order for the output to change state." range="13:9" rwaccess="R/W"/>
	<bitfield id="SAMPWIN" width="5" begin="8" end="4" resetval="0x0" description="Low filter sample window size. Number of samples to monitor is SAMPWIN+1." range="8:4" rwaccess="R/W"/>
	</register><register id="SDFM_SDCOMP3EVT2FLTCLKCTL" acronym="SDFM_SDCOMP3EVT2FLTCLKCTL" offset="228" width="16" description="COMPL/CEVT2 Digital filter3 Clock Control Register.">
		<bitfield id="CLKPRESCALE" width="10" begin="9" end="0" resetval="0x0" description="Low filter sample clock prescale. Number of system clocks between samples." range="9:0" rwaccess="R/W"/>
	</register><register id="SDFM_SDCOMP3EVT1FLTCTL" acronym="SDFM_SDCOMP3EVT1FLTCTL" offset="230" width="16" description="COMPH/CEVT1 Digital filter3 Control Register.">
		<bitfield id="FILINIT" width="1" begin="15" end="15" resetval="0x0" description="High filter initialization.    0  No effect   1  Initialize all samples to the filter input value" range="15" rwaccess="R/W1TS"/>
	<bitfield id="THRESH" width="5" begin="13" end="9" resetval="0x0" description="High filter majority voting threshold. At least THRESH samples of the opposite state must appear within the sample window in order for the output to change state." range="13:9" rwaccess="R/W"/>
	<bitfield id="SAMPWIN" width="5" begin="8" end="4" resetval="0x0" description="High filter sample window size. Number of samples to monitor is SAMPWIN+1." range="8:4" rwaccess="R/W"/>
	</register><register id="SDFM_SDCOMP3EVT1FLTCLKCTL" acronym="SDFM_SDCOMP3EVT1FLTCLKCTL" offset="232" width="16" description="COMPH/CEVT1 Digital filter3 Clock Control Register.">
		<bitfield id="CLKPRESCALE" width="10" begin="9" end="0" resetval="0x0" description="High filter sample clock prescale. Number of system clocks between samples." range="9:0" rwaccess="R/W"/>
	</register><register id="SDFM_SDCOMP3LOCK" acronym="SDFM_SDCOMP3LOCK" offset="238" width="16" description="SD  compartor event filter3 Lock Register.">
		<bitfield id="COMP" width="1" begin="3" end="3" resetval="0x0" description="Lock write-access to the SDCOMP3EVT1/2FLTTCTL and COMP3FILCLKCTL registers.    0  SDCOMP3EVT1/2FLTCTL and SDCOMP3EVT1/2FLTCLKCTL registers are not locked. Write 0 to this bit has no effect.   1  SDCOMP3EVT1/2FLTCTL and SDCOMP3EVT1/2FLTCLKCTL registers are locked. Only a system reset can clear this bit." range="3" rwaccess="R/W1TS"/>
	<bitfield id="SDCOMP3CTL" width="1" begin="0" end="0" resetval="0x0" description="Lock write-access to the SDCOMP3CTL register.    0  SDCOMP3CTL register is not locked. Write 0 to this bit has no effect.   1  SDCOMP3CTL register is locked. Only a system reset can clear this bit." range="0" rwaccess="R/W1TS"/>
	</register><register id="SDFM_SDCOMP4CTL" acronym="SDFM_SDCOMP4CTL" offset="240" width="16" description="SD Comparator event filter4 Control Register.">
		<bitfield id="CEVT2DIGFILTSEL" width="2" begin="11" end="10" resetval="0x0" description="High comparator COMPH source select.    0  CEVT2 output drives COMPLOUT   1  Reserved   2  Output of digital filter drives COMPLOUT   3  Reserved" range="11:10" rwaccess="R/W"/>
	<bitfield id="CEVT1DIGFILTSEL" width="2" begin="3" end="2" resetval="0x0" description="High comparator COMPH source select.    0  CEVT1 output drives COMPHOUT   1  Reserved   2  Output of digital filter drives COMPHOUT   3  Reserved" range="3:2" rwaccess="R/W"/>
